{
    "disclaimer": "This file was automatically generated. Do not edit.",
    "title": "Calado",
    "name": "Pedro Calado",
    "whoami": [
        "A software engineer, passionate about computers since childhood. Self motivated, result oriented and always looking for new challenges.",
        "Luckily surrounded by very talented people, learned not just about software, but also about team spirit and strategic thinking."
    ],
    "experience": [
        {
            "id": "worten",
            "title": "Tech Lead",
            "dates": "Since Nov 2020",
            "company_name": "Worten",
            "description": "Tech leading a team of 12. Designed and implemented solutions for order orchestration and shopping cart rules. Streamlined team's development process while deploying to production multiple times per week. Worten is part of Sonae group, which had over 7 Billion € turnover in 2021.",
            "extra": "Created a system processing 100's of thousands of order updates per day using mostly Kafka and PostgreSQL. Steered the team with continuous deployment methodology averaging over 2 releases per day (including hot-fixes) over the last two years.",
            "tags": ["Go", "AWS", "Terraform"]
        },
        {
            "id": "metric4-founder",
            "title": "Founder and Developer",
            "dates": "Nov 2017 to Oct 2020",
            "company_name": "METRIC4",
            "description": "Developer of backend services and sensor firmware. Worked as a consultant since January 2020, the clients were based in Switzerland.",
            "extra": "Developed a threads and messages middleware (in Rust) to run on low end hardware with intermittent connectivity. Wrote drivers for several peripherals, tools for logging and monitoring, self updated, still running today. Wrote services in Go for data ingestion, monitoring, user notifications, realtime feeds, KPI batch processes and metadata APIs. Contributed to a Rust microservices framework used to deploy services in a Kubernetes cluster. Communicated among services using gRPC and controlled ingress using Istio. Used a custom DSL to generate database schema and GraphQL queries / mutations. Provisioned everything using terraform. Invested heavily in CI/CD and fostered code reviews. Having never done it before, developed a frontend client facing application in Typescript using React. The apps ranged from IoT, banking, to warehouse management solutions.",
            "tags": ["Go", "Rust", "Python", "AWS", "Kubernetes", "Terraform"]
        },
        {
            "id": "movvo",
            "title": "Senior Developer and Product Manager",
            "dates": "May 2015 to Nov 2017",
            "company_name": "Movvo Inc",
            "description": "Senior developer of backend services and sensor firmware. Product manager bridging customer's expectations and tech development. Movvo focused on analytics for retail.",
            "extra": "Worked in an english speaking environment reporting to UK management. Translated a cloud solution ingesting millions of messages per day, from Python to Go. Exploited Go's concurrency patterns and zeroMQ to load, transport and store large amounts of data. Built a KPI pipeline for batch processing to support our Data Science team, in Go and Python. Led the development of sensor firmware in C for a MIPS CPU.",
            "tags": ["Go", "C", "Python"]
        },
        {
            "id": "lsts",
            "title": "Researcher and Software Developer",
            "dates": "Sep 2009 to Apr 2015",
            "company_name": "LSTS at FEUP",
            "description": "Research engineer and software developer. LSTS develops robotic systems for ocean operations.",
            "extra": "Among top 3 contributors to DUNE, in C++. Responsible for control and maneuvering tasks of an Autonomous Underwater Vehicle. Wrote peripheral drivers, implemented guidance algorithms, monitoring and coulomb counting. Main developer of an ATxmega based system, in C language. Wrote drivers for GSM modem, Bluetooth, GPS and other peripherals.",
            "tags": ["C++", "C"]
        },
        {
            "id": "masters",
            "title": "Education",
            "dates": "2004 to 2009",
            "company_name": "FEUP, Porto, Portugal",
            "description": "Master's degree in Electrical and Computers Engineering, 16 GPA (0-20 scale). Master's thesis in 'Nonlinear Control of Underwater Vehicles' (written in English), 19 Grade Points (0-20 scale)."
        }
    ],
    "open_source": [
        {
            "before": "Contribution to",
            "link": "https://github.com/hyperium/hyper/pull/2315",
            "repo": "hyperium/hyper",
            "tags": ["Rust"]
        },
        {
            "before": "Contribution to",
            "link": "https://github.com/hyperium/tonic/pull/486",
            "after": "(codermobster is an alias I own)",
            "repo": "hyperium/tonic",
            "tags": ["Rust"]
        },
        {
            "before": "Heavy contributor to",
            "link": "https://gitlab.com/pedrocalado/mrbig",
            "repo": "mrbig",
            "tags": ["Rust"]
        },
        {
            "before": "Contribution to",
            "link": "https://github.com/valpackett/systemstat/pull/46",
            "repo": "valpackett/systemstat",
            "tags": ["Rust"]
        },
        {
            "before": "Heavy contributor to",
            "link": "https://github.com/LSTS/dune",
            "repo": "DUNE",
            "tags": ["C", "C++"]
        },
        {
            "before": "This very website",
            "link": "https://github.com/pdcalado/mincv.git",
            "repo": "pdcalado/mincv",
            "tags": ["HTML", "CSS"]
        }
    ],
    "footer": [
        "This website does not use cookies or gather any data from its visitors.",
        "© 2022 Pedro Calado - all rights reserved"
    ]
}
